Tekla Open API Reference for Tekla Structures 2025
AnalysisObject Methods
The AnalysisObject type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis object from the database.
Top
See Also
Reference
AnalysisObject Class
Tekla.Structures.Analysis Namespace